---
kind: type
id: T:Autodesk.Revit.DB.LayoutRuleFixedDistance
source: html/a2910330-3b62-58d3-0f1a-e322ec4fb32c.htm
---
# Autodesk.Revit.DB.LayoutRuleFixedDistance

This class indicate the layout rule of a Beam System is Fixed-Distance.

## Syntax (C#)
```csharp
public class LayoutRuleFixedDistance : LayoutRule
```

## Remarks
To use this type of LayoutRule, the distance between the beams and the justify-type must be set.